import React, {Component} from 'react';
import {
  Platform,
  StyleSheet,
  View,
  Button,
  Image,
  StatusBar,
  TouchableOpacity,
} from 'react-native';
import {Text, Title, Paragraph} from 'react-native-paper';

import Icon from 'react-native-vector-icons/MaterialCommunityIcons';
import {ScrollView} from 'react-native-gesture-handler';
import {SafeAreaView} from 'react-native-safe-area-context';



const PolicyScreen = ({navigation}) => {
  return (
    <SafeAreaView style={styles.container}>
      <StatusBar
        translucent
        backgroundColor="transparent"
        animated={false}
        barStyle="dark-content"
        showHideTransition
      />

      <View
        style={{
          paddingVertical: 10,
          flexDirection: 'row',
          alignItems: 'center',
        }}>
        <TouchableOpacity
          onPress={() => {
            navigation.goBack();
          }}>
          <Icon
            name="arrow-left-thick"
            size={24}
            color="gray"
            style={{marginRight: 10, alignSelf: 'center'}}
          />
        </TouchableOpacity>
        <Title>นโยบายความเป็นส่วนตัว</Title>
      </View>
      <ScrollView
        showsVerticalScrollIndicator={false}
        showsHorizontalScrollIndicator={false}
        scrollEventThrottle={16}
        onMomentumScrollEnd={event => {
          // scroll animation ended
          console.log(event);
        }}>
        <View style={{paddingVertical: 10}}>
          <View style={{marginVertical: 10}}>
            <Paragraph style={styles.fontParagrap}>
              Go Mamma สวัสดีค่ะ
              เรารู้สึกยินดีเป็นอย่างยิ่งที่ท่านสนใจในบริการของเรา
              ขอบคุณที่ไว้ใจให้เราดูแลคุณ
              เรามีจุดมุ่งหมายในการให้บริการเพื่อประโยชน์สูงสุดของผู้ใช้บริการดังนั้นเพื่อความสะดวกในการใช้บริการ
              เราอาจต้องเก็บรวบรวมข้อมูลส่วนตัวของท่าน รวมถึงข้อมูลอื่นๆ
              เพื่อการให้บริการที่ ตรงใจ เข้าใจ ไว้ใจได้
              ด้วยเหตุนี้เราจึงอยากให้ท่านอ่านทบทวนนโยบายฉบับนี้
              เพื่อให้ท่านเข้าใจแนวทางการปฏิบัติของเรา
            </Paragraph>
          </View>
          <View style={{marginVertical: 10}}>
            <Title>คำนำ</Title>
            <Paragraph style={styles.fontParagrap}>
              ข้อมูลส่วนบุคคลถือเป็นสิ่งที่สำคัญ
              ดังนั้นเราจึงได้พัฒนานโยบายความเป็นส่วนตัวนี้เพื่ออธิบายถึงวิธีที่เราเก็บรวบรวม
              ใช้ เปิดเผย โอน และดำเนินการเกี่ยวกับข้อมูลของท่าน
              กรุณาอ่านและทำความเข้าใจเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ก่อนใช้งานโกวมาม่าแอพพลิเคชั่น
              ในการใช้งานโกวมาม่าแอพพลิเคชั่น
              หมายถึงท่านยินยอมให้ทางเราเก็บรวบรวม ใช้ เปิดเผย
              และเก็บรักษาข้อมูลส่วนบุคคลของท่านตามที่กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้
              โปรดอ่านข้อตกลงการให้บริการนี้อย่างละเอียดถี่ถ้วน การใช้บริการ
              (ตามที่จะกล่าวถึงและกำหนดไว้ด้านล่าง)
              จะถือว่าคุณได้ยอมรับว่าคุณได้อ่าน และเข้าใจในข้อกำหนดต่าง ๆ
              ที่ระบุไว้ในข้อตกลงการให้บริการนี้ ข้อตกลงการให้บริการและ
              นโยบายของโกวมาม่า (ตามที่จะกล่าวถึงและกำหนดไว้ด้านล่าง)
              จะมีผลบังคับใช้กับคุณ และถือเป็นข้อตกลงที่มีผลผูกพันทางกฎหมาย
              ระหว่างคุณกับโกวมาม่า (“ ข้อตกลง”)
              (ตามที่จะกล่าวถึงและกำหนดไว้ด้านล่าง)
              ข้อตกลงจะมีผลบังคับใช้กับการใช้บริการของคุณ
              (ตามที่จะกล่าวถึงและกำหนดไว้ด้านล่าง) ที่ให้บริการโดยโกวมาม่า
              หากคุณไม่ตกลงตามข้อตกลงการให้บริการนี้
              โปรดยกเลิกหรือหยุดการใช้งานแพลตฟอร์มหรือบริการ
              (ตามที่จะกล่าวถึงและกำหนดไว้ด้านล่าง) ทันที
            </Paragraph>
            <Paragraph style={styles.fontParagrap}>
              {'\n'}
              นโยบายความเป็นส่วนตัวฉบับนี้มีผลกับเว็บไซต์ แอป กิจกรรม
              และบริการอื่นๆ ทุกอย่างที่ Go Mamma เป็นผู้ดำเนินการ
              โดยเราเรียกโดยรวมว่า “บริการ” โดย
              <Text style={{fontFamily: 'Prompt-Bold'}}>
                {' '}
                เริ่มมีผลบังคับใช้ตั้งแต่วันที่ 10 กันยายน 2565
                (“วันที่มีผลบังคับใช้”)
              </Text>
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Title>1. เกี่ยวกับเรา</Title>
            <Paragraph  style={styles.fontParagrap}>
              โกวมาม่าคือ บริการรัถรับ-ส่ง แท็กซี่สำหรับผู้สูงอายุ
              เป็นหนึ่งในแบรนด์ที่ถูกบริหารงานภายใต้บริษัท บางกอกแนนนี่เซ็นเตอร์
              จำกัด เราเป็นบริษัทจำกัดสัญชาติไทย
              ที่เป็นผู้รับผิดชอบดูแลข้อมูลของคุณภายใต้นโยบายความเป็นส่วนตัวฉบับนี้
              บริษัทของเราตั้งอยู่ตามที่อยู่ด้านล่างนี้ บริษัท
              บางกอกแนนนี่เซ็นเตอร์ จำกัด 152/4 หมู่บ้านพลัสซิตี้พาร์ค
              ศรีนครินทร์ สวนหลวงร.9 แขวงหนองบอน เขตประเวศ กรุงเทพฯ 10250
              ประเทศไทย
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Title>2. การเก็บรวบรวมข้อมูล</Title>
            <Paragraph style={styles.fontParagrap}>
              ในนโยบายความเป็นส่วนตัวนี้ “ข้อมูลส่วนบุคคล”
              หมายถึงข้อมูลหรือรายละเอียดข้อมูลที่สามารถใช้ระบุตัวตนได้
              เรารวบรวมข้อมูลของท่านเมื่อท่านแอพพลิเคชั่นโกวมาม่า
              ข้อมูลที่เรารวบรวมคือ ข้อมูลที่ท่านมอบให้แก่เรา
              ท่านอาจมอบข้อมูลดังต่อไปนี้ให้แก่เรา
            </Paragraph>

            {[
              'รายละเอียดข้อมูลส่วนบุคคล เช่น ชื่อ โรคประจำตัว เพศ ที่อยู่ อีเมล หมายเลขโทรศัพท์มือถือ วันเดือนปีเกิด หรือข้อมูลการติดต่ออื่นๆ เมื่อท่านลงทะเบียนในแอพพลิเคชั่นโกวมาม่า',
              'ข้อมูลการทำธุรกรรมรวมถึงข้อมูลเกี่ยวกับผลิตภัณฑ์ที่ท่านซื้อ ราคา วิธีการชำระเงิน และรายละเอียดการชำระเงินอื่นๆ',
              'ข้อมูลบัญชีผู้ใช้ เช่น ชื่อผู้ใช้ หรือ รหัสผ่าน (หรือข้อมูลอื่นๆที่ระบุถึงตัวท่าน) ที่ใช้เพื่อเข้าถึงแอพพลิเคชั่นโกวมาม่า และ',
              'ข้อมูลส่วนบุคคลอื่นๆ ที่ท่านให้เราเมื่อท่านโต้ตอบกับเรา',
              'การถ่ายภาพ หรือการเข้าถึงภาพถ่ายบนอุปกรณ์ของท่าน เมื่อใช้บริการของเรา ซึ่งท่านสามารถเลือกให้เราสามารถเข้าถึง หรือไม่เข้าถึงก็ได้ตามความสมัครของท่าน',
            ].map((item, key) => (
              <Paragraph
                key={key}
                style={[styles.fontParagrap, {paddingLeft: 20}]}>
                <Text style={{fontSize: 10}}>{'\u2B24'}</Text> {item}
              </Paragraph>
            ))}

            <Paragraph style={styles.fontParagrap}>
              เมื่อคุณลงทะเบียน เข้า หรือเข้าร่วมกิจกรรมส่งเสริมการขาย
              งานกิจกรรม หรือกิจกรรมอื่นๆ ไม่ว่าจะอยู่บนแพลตฟอร์มหรือไม่ก็ตาม
              เราอาจเก็บรวบรวมข้อมูลที่คุณมอบให้เราในระหว่างกระบวนการเหล่านั้น
              หากคุณติดต่อเรา
              เราอาจเก็บรวบรวมข้อมูลของคุณในระหว่างการสนทนาโต้ตอบด้วย
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Title>3. การใช้ข้อมูล</Title>
            <Paragraph style={styles.fontParagrap}>
              การมีข้อมูลที่ถูกต้องของท่านช่วยให้เราสามารถให้บริการท่านด้วยความราบรื่น
              มีประสิทธิภาพ และสอดคล้องกับประสบการณ์ของท่าน
              เราอาจใช้ข้อมูลของท่านที่รวบรวมไว้เพื่อ:
              สร้างและจัดการบัญชีของท่าน ดำเนินการตามคำสั่งซื้อ ชำระเงิน
              และการทำธุรกรรมอื่นๆ ที่เกี่ยวกับแอพพลิเคชั่นโกวมาม่า
              ตอบสนองเกี่ยวกับผลิตภัณฑ์และคำร้องขอบริการของลูกค้า
              รวบรวมข้อมูลทางสถิติที่ไม่สามารถระบุตัวตนได้
              และการวิเคราะห์ข้อมูลสำหรับใช้ภายในหรือกับบุคคลภายนอก
              ตรวจสอบและวิเคราะห์การใช้งานและแนวโน้มเพื่อปรับปรุงประสบการณ์ของท่านที่มีกับแอพพลิเคชั่นโกวมาม่า
              เพิ่มประสิทธิภาพและการดำเนินการของแอพพลิเคชั่นโกวมาม่า
              ป้องกันการฉ้อโกง ตรวจสอบการโจรกรรม และป้องกันอาชญากรรม
              รวมถึงการรักษาความปลอดภัยให้กับบัญชีท่าน
              ปฏิบัติตามกฎหมายที่บังคับใช้
              เพื่อให้ท่านได้รับประโยชน์จากการใช้ผลิตภัณฑ์และ/หรือบริการ
              เราอาจใช้ข้อมูลตามที่ท่านเลือกให้ความยินยอมไว้เพื่อ: {'\n'}
              ติดต่อท่านเพื่อส่งข้อมูลเกี่ยวกับผลิตภัณฑ์และการบริการที่ท่านอาจสนใจ
              นำเสนอผลิตภัณฑ์ใหม่ การบริการและ/หรือคำแนะนำแก่ท่าน
              ส่งโฆษณาที่ตรงเป้าหมาย ข่าวสาร และข้อมูลอื่นๆ
              เกี่ยวกับโปรโมชั่นหรือกิจกรรมพิเศษให้กับท่าน ประสบการณ์การใช้งาน:
              เรามุ่งมั่นที่จะมอบประสบการณ์การใช้งานที่ดีที่สุดให้คุณ
              และข้อมูลของคุณก็เป็นส่วนหนึ่งที่ช่วยให้เราสามารถสร้างประสบการณ์นั้น
              ประโยชน์อันชอบด้วยกฎหมาย: เราอาจใช้ข้อมูลของคุณเมื่อจำเป็น
              และเราอาจทำการวิเคราะห์พฤติกรรมของผู้ที่ใช้บริการของเราเพื่อช่วยในการพัฒนาและคิดค้นฟีเจอร์และบริการใหม่ๆ
              รวมถึงทำให้บริการของเราปลอดภัยอยู่เสมอ {'\n'}ความยินยอมของคุณ:
              เราอาจขอความยินยอมจากคุณในการใช้ข้อมูลของคุณเพื่อเหตุผลบางประการ
              คุณสามารถถอนความยินยอมได้ทุกเมื่อโดยการติดต่อเราตามที่อยู่ท้ายนโยบายความเป็นส่วนตัวฉบับนี้
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Title>4. สิทธิในข้อมูลส่วนบุคคลของท่าน</Title>

            {[
              'ท่านมีสิทธิในการเข้าถึง ขอรับสำเนาข้อมูลส่วนบุคคล หรือขอให้เปิดเผยการได้มาของข้อมูลส่วนบุคคลนั้น เว้นแต่กรณีที่เรามีสิทธิปฏิเสธคำขอของท่านตามกฎหมายหรือคำสั่งศาล หรือกรณีที่คำขอของท่านจะมีผลกระทบที่อาจก่อให้เกิดความเสียหายต่อสิทธิและเสรีภาพของบุคคลอื่น',
              'ท่านมีสิทธิในการขอแก้ไขหรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของท่าน ในกรณีที่ข้อมูลนั้นไม่ถูกต้องหรือไม่ครบถ้วน และทำให้ข้อมูลของท่านเป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด',
              'ท่านมีสิทธิในการขอให้ลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านกลายเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลได้ เว้นแต่กรณีที่เราต้องปฏิบัติตามกฎหมายที่เกี่ยวข้องในการเก็บรักษาข้อมูลดังกล่าว',
              'ท่านมีสิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่านชั่วคราวหรือถาวรได้',
              'ท่านมีสิทธิในการคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน เว้นแต่กรณีที่เรามีเหตุในการปฏิเสธคำขอของท่านโดยชอบด้วยกฎหมาย',
              'ท่านมีสิทธิในการขอรับข้อมูลส่วนบุคคลของท่านในรูปแบบอิเล็กทรอนิกส์ หรือขอให้ส่งหรือโอนข้อมูลดังกล่าวไปยังบุคคลภายนอก เว้นแต่กรณีที่เราไม่สามารถทำได้โดยสภาพทางเทคนิคหรือมีเหตุในการปฏิเสธคำขอของท่านโดยชอบด้วยกฎหมาย',
              'ท่านมีสิทธิในการขอถอนความยินยอมที่ได้ให้ไว้กับเราเมื่อใดก็ได้ ตามขั้นตอนและวิธีการที่เรากำหนด เว้นแต่โดยสภาพไม่สามารถถอนความยินยอมได้ ทั้งนี้การถอนความยินยอมของท่านอาจส่งผลกระทบในการใช้งานเว็บไซต์สมาชิกยาโยอิ ของท่าน',
              'ท่านมีสิทธิในการร้องเรียนต่อหน่วยงานรัฐที่เกี่ยวข้อง ในกรณีที่ท่านเชื่อว่าการกระทำของเราไม่เป็นไปตามที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ได้บัญญัติไว้',
            ].map((item, key) => (
              <Paragraph
                key={key}
                style={[styles.fontParagrap, {paddingLeft: 20}]}>
                <Text style={{fontSize: 10}}>{'\u2B24'}</Text> {item}
              </Paragraph>
            ))}
          </View>

          <View style={{marginVertical: 10}}>
            <Title>5. เครื่องมือในการบริหารสิทธิของคุณ</Title>
            <Paragraph style={styles.fontParagrap}>
              {
                'คุณสามารถควบคุมข้อมูลที่เราจะทำการรวบรวมได้ผ่านเครื่องมือต่อไปนี้\n\nเครื่องมืออัพเดทโปรไฟล์: คุณสามารถเข้าถึงและอัพเดทชื่อและรูปภาพโปรไฟล์ของคุณด้วยเครื่องมือที่มีในแอป หากมีข้อสงสัยเกี่ยวกับการใช้เครื่องมือนี้ โปรดติดต่อเรา\n\nการตั้งค่าสิทธิบนอุปกรณ์: คุณสามารถควบคุมการเข้าถึงฟังก์ชันบางอย่างบนอุปกรณ์ของคุณได้ภายใต้ “การตั้งค่า” บนอุปกรณ์ของคุณ แต่การจำกัดสิทธิบางอย่างอาจทำให้แอปพลิเคชันไม่สามารถทำงานได้อย่างเต็มประสิทธิภาพ \n\nการถอนการติดตั้งแอปพลิเคชัน: หากคุณถอนการติดตั้งแอปของเรา เราจะไม่สามารถเก็บรวบรวมข้อมูลของคุณได้อีกต่อไป ในกรณีที่คุณถอนการติดตั้งแอปจากอุปกรณ์มือถือ ระบบจะยังเก็บตัวบ่งชี้อุปกรณ์ของคุณไว้ต่อไป เมื่อคุณทำการติดตั้งแอปพลิเคชันใหม่อีกครั้งบนอุปกรณ์มือถือเครื่องเดิม ตัวบ่งชี้ดังกล่าวจะทำให้เราสามารถจดจำอุปกรณ์ของคุณรวมถึงธุรกรรมและกิจกรรมอื่นๆ ได้'
              }
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Title>6. ความปลอดภัยของข้อมูล</Title>
            <Paragraph style={styles.fontParagrap}>
              เราใช้มาตรการรักษาความปลอดภัยที่ดีที่สุดเพื่อปกป้องข้อมูลอันมีค่าของคุณ
              แต่เราไม่สามารถรับรอง
              และคุณไม่ควรคาดหวังว่าข้อมูลส่วนตัวของคุณจะปลอดภัยตลอดไป{'\n'}
              เราอาจระงับการใช้บริการของเราทั้งหมดหรือบางส่วนโดยไม่แจ้งให้ทราบหากว่าเราสงสัยหรือตรวจพบการละเมิดความปลอดภัย
            </Paragraph>
          </View>
          <View style={{marginVertical: 10}}>
            <Title>6. ความปลอดภัยของข้อมูล</Title>
            <Paragraph style={styles.fontParagrap}>
              เราใช้มาตรการรักษาความปลอดภัยที่ดีที่สุดเพื่อปกป้องข้อมูลอันมีค่าของคุณ
              แต่เราไม่สามารถรับรอง
              และคุณไม่ควรคาดหวังว่าข้อมูลส่วนตัวของคุณจะปลอดภัยตลอดไป{'\n'}
              เราอาจระงับการใช้บริการของเราทั้งหมดหรือบางส่วนโดยไม่แจ้งให้ทราบหากว่าเราสงสัยหรือตรวจพบการละเมิดความปลอดภัย
            </Paragraph>
          </View>
          <View style={{marginVertical: 10}}>
            <Title>7. การเก็บรักษาข้อมูล</Title>
            <Paragraph style={styles.fontParagrap}>
              เราจะเก็บรวบรวมข้อมูลส่วนตัวของคุณไว้ตราบเท่า
              ที่เราจำเป็นต้องใช้เพื่อจุดประสงค์ทางธุรกิจและทางกฎหมาย
              และตราบเท่าที่กฎหมายที่เกี่ยวข้องอนุญาตให้ทำ {'\n'}
              โปรดทราบว่าเนื่องจากข้อจำกัดทางด้านเทคนิค
              เราจึงไม่สามารถให้คำรับรองหรือระบุช่วงเวลาอันแน่ชัดที่จะลบข้อมูลทั้งหมดหรือทำให้ข้อมูลของคุณไม่ระบุตัวตนอย่างสมบูรณ์ได้
            </Paragraph>
          </View>
          <View style={{marginVertical: 10}}>
            <Title>8. การเปลี่ยนแปลงนโยบาย</Title>
            <Paragraph style={styles.fontParagrap}>
              นโยบายของเราอาจมีการเปลี่ยนแปลงเป็นระยะเพื่อให้สอดคล้องกับกฎหมายที่เกี่ยวข้อง
              รวมถึงแนวทางการดำเนินธุรกิจและหลักปฏิบัติอื่นๆ อยู่เสมอ
              เราจะแจ้งให้คุณทราบทุกครั้งก่อนจะทำการเปลี่ยนแปลงใดๆ
              ที่อาจส่งผลต่อสิทธิและภาระผูกพันทางกฎหมายของคุณ
              เพื่อให้คุณได้ตรวจสอบก่อนที่การเปลี่ยนแปลงดังกล่าวจะมีผลบังคับใช้
              ในกรณีที่การเปลี่ยนแปลงนโยบายไม่ส่งผลต่อสิทธิและภาระผูกพันทางกฎหมายของคุณ
              เราจะแจ้งให้คุณทราบหลังจากดำเนินการเปลี่ยนแปลงเรียบร้อยแล้ว
            </Paragraph>
          </View>
          <View style={{marginVertical: 10}}>
            <Title>9. ติดต่อเรา</Title>
            <Paragraph style={styles.fontParagrap}>
              หากคุณมีข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัวฉบับนี้
              หรือต้องการถอนความยินยอมของคุณ โปรดติดต่อเราทางออนไลน์ได้ที่
              Gomamma.seniorr@gmail.com หรือทางโทรศัพท์ที่หมายเลข 0 ในเวลาทำการ
              ตั้งแต่ 8.00-18.00 น. วันจันทร์-ศุกร์ ยกเว้นวันหยุดนักขัตฤกษ์
            </Paragraph>
          </View>

          <View style={{marginVertical: 10}}>
            <Paragraph style={styles.fontParagrap}>
              เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
              เราได้มีการดำเนินการปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562 โดยแต่งตั้งเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (Data
              Protection Officer : DPO)
              เพื่อตรวจสอบการดำเนินการของเราที่เกี่ยวกับการเก็บรวบรวม ใช้
              และเปิดเผยข้อมูลส่วนบุคคลให้สอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562 รวมถึงกฎหมายที่เกี่ยวข้องกับการคุ้มครองข้อมูลส่วนบุคคล
              นอกจากนี้เราได้จัดกฎระเบียบและออกคำสั่งให้ผู้เกี่ยวข้องดำเนินการตามที่กำหนดไว้
              และเพื่อให้การดำเนินงานตามแนวนโยบายความเป็นส่วนตัวเป็นไปด้วยความเรียบร้อยและมีประสิทธิภาพ
            </Paragraph>
          </View>
        </View>
      </ScrollView>
    </SafeAreaView>
  );
};
export default PolicyScreen;

const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: 'white',
    paddingHorizontal: 20,
  },
  welcome: {
    fontSize: 20,
    textAlign: 'center',
    margin: 10,
  },
  fontParagrap: {
    fontSize: 12,
  },
});
